/*Варіант 27 Обчислити значення квадратного кореня із числа a>0 із заданою точністю e
 на основі рекурентного співвідношення*/

#include <iostream>
using namespace std;
#include <math.h>


int main()
{


    double a, e; //Введення змінної a, e -  задана точність
    cout << "Enter your a: ";
    cin >> a;
    cout << "Enter your e: ";
    cin >> e;



    double xn0 = a / 2; // Обчислення xn0 - перший член рекурентного співвідношення
    double  xn1 = 0.5 * (xn0 + a / xn0);//Другий xn1 - член рекурентного співвідношення
    while (abs(xn0 - xn1) >= e)  //Умова циклу
    {
        xn0 = xn1; // Збереження значення попереднього члена рекурентного співвідношення
        xn1 = 0.5 * (xn0 + a / xn0);//Обчислення наступного члена рекурентного співвідношення
        cout << xn1 << "\n"; // Виведення значення xn1 - результат
    }

     

    return 0;

}