#include <iostream>
#include <cmath>
using namespace std;

//Варіант#27  Дані гіпотенуза і катет прямокутного трикутника. Знайти радіус вписаного у нього кола.

int main() {
    double a, b, c, r; //Введення змінних типу double - задання  об'єктів задачі: сторін прямокутного трикутника і радіуса вписаного кола у цей трикутник
    cout << " Enter the length of the first leg: "; //Напис-запрошення для вводу значення першого катета
    cin >> a; //Ввід користувачем значення першого катета
    cout << " Enter the length of the hypotenuse: "; //Напис-запрошення для введення значення гіпотенузи 
    cin >> c;  //Ввід користувачем значення гіпотенузи
    b = sqrt(pow(c, 2) - pow(a, 2)); //Задання значення для змінної b(другого катета) за допомогою математичної формули(Теорема Піфагора)
    r = (a + b - c) / 2; //Задання значення для перемінної r за допомогою формули для знаходження радіуса вписаного кола у прямокутний трикутник та знайденої змінної b 
    cout << " The length of the radius of the inscribed circle is " << r; //Виведення значення радіуса вписанного кола у прямокутний трикутник
    return 0; 
}
