#Варіант 27 Дані гіпотенуза і катет прямокутного трикутника. Знайти радіус вписаного у нього кола.

import math
a = float(input("Введіть довжину катета: ")) #Введення зміної a(перший катет) та застосування користувацького вводу для неї
c = float(input("Введіть довжину гіпотенузи:")) #Введення зміної c(гіпотенуза) та застосування користувацького вводу для неї
b = math.sqrt(pow(c,2)-pow(a,2)) #Задання  значення змінної b(другого катета) за рахунок використання математичної формули(Теорема Піфагора)
r = (a+b-c)/2 #Задання значення змінної r(радіус вписаного кола у прямокутний трикутник) за рахунок використання математичної формули
print("Довжина вписаного кола: " + str(r)) #Виведення напису, а також значення змінної r

